system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.001;

deltaT          1e-6;  

writeControl    adjustable;

writeInterval   0.0001;

purgeWrite      0;

writeFormat     binary;

writePrecision  4;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

maxCo           0.3;  // Reduced for better stability

maxDi           3.0;

adjustTimeStep  yes;



// ************************************************************************* //
