system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    arch "LSB;label=32;scalar=64";
    class dictionary;
    location "system/solid";
    object fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers {
    h {
        solver PCG;
        preconditioner DIC;
        tolerance 1e-06;
        relTol 0.1; // Already good
    }

    hFinal {
        $h;
        tolerance 1e-06;
        relTol 0;
    }
}

PIMPLE {
    nNonOrthogonalCorrectors 0;  // Reduced for stability
    nCorrectors 2;               // Reduced to match fluid
    nOuterCorrectors 2;          // Match fluid region

    residualControl {
        h 1e-3; // Further relaxed for faster convergence
    }
}

relaxationFactors {
    equations {
        h 0.5; // Increased from 0.2 for better convergence
    }
}

// ************************************************************************* //